import numpy as np
import matplotlib.pyplot as plt
from matplotlib.ticker import MultipleLocator, AutoMinorLocator
import mpltern

# 데이터 포인트 생성
ax = plt.subplot(projection="ternary")

# 데이터 포인트 생성
points1 = np.array([
    [0.0625, 0.1875, 0.75],
    [0.0625, 0.75, 0.1875],
    [0.0625, 0.9375, 0],
    [0.125, 0.375, 0.5],
    [0.125, 0.75, 0.125],
    [0.125, 0.875, 0],
    [0.167, 0.25, 0.25],
    [0.1875, 0.5625, 0.25],
    [0.1875, 0.75, 0.125],
    [0.1875, 0.8125, 0],
    [0.25, 0.5625, 0.1875],
    [0.25, 0.75, 0],
    [0.33, 0.167, 0.167],
    [0.33, 0.33, 0],
    [0.4375, 0.5625, 0],
    [0.5, 0.083, 0.083],
    [0.5, 0.375, 0.125],
    [0.625, 0.375, 0],
    [0.66, 0, 0],
    [0.75, 0.1875, 0.0625],
    [0.8125, 0.1875, 0],
    [0, 0.1875, 0.8125],
    [0, 0.33, 0.33],
    [0, 0.375, 0.625],
    [0, 0.5625, 0.4375],
    [0, 0.75, 0.25],
    [0, 0.8125, 0.1875],
    [0, 0.875, 0.125],
    [0, 0.9375, 0.0625],
    [0, 1, 0]
])

points2 = np.array([
    [0.125, 0.25, 0.375],
    [0.1875, 0.1875, 0.375],
    [0.25, 0.25, 0.25],
    [0.25, 0.5, 0],
    [0.375, 0.125, 0.25],
    [0.5, 0.25, 0],
    [0.5, 0, 0.25],
    [0.5, 0, 0],
    [0.5625, 0.0625, 0.125],
    [0.6875, 0.0625, 0],
    [0.75, 0, 0],
    [0, 0.25, 0.5],
    [0, 0.5, 0.5],
    [0, 0, 0.5]
])

points3 = np.array([
    [0.21875,0.5625,0.09375],
    [0.25,0.75,0],
    [0.25,0,0.75],
    [0.4375,0.375,0.0625],
    [0.5,0.5,0],
    [0.5,0,0.5],
    [0.65625,0.1875,0.03125],
    [0.75,0.25,0],
    [0.75,0,0.25],
    [0.875,0,0],
    [1,0,0],
    [0,0.25,0.75],
    [0,0.5,0.5],
    [0,0.75,0.125],
    [0,0.75,0.25],
    [0,1,0],
    [0,0,1]
])

points4 = np.array([
    [0.167,0,0.5],
    [0.33,0,0.33],
    [0.5,0,0.33],
    [0,0,0.66],
    [0.66,0,0]
])

points5 = np.array([
    [0.375,0.25,0.125],
    [0.5625,0.1875,0],
    [0.625,0.125,0]
])

points6 = np.array([
    [0.125, 0.1875, 0.4375],
    [0.25, 0.25, 0.75],
    [0.375, 0.0625, 0.3125],
    [0.5, 0.0625, 0.1875],
    [0.5, 0.125, 0.125],
    [0.5, 0.1875, 0.0625],
    [0.5625, 0, 0.1875],
    [0.625, 0, 0.125],
    [0.625, 0, 0],
    [0.625, 0, 0],
    [0.6875, 0, 0.0625],
    [0.75, 0, 0],
    [0, 0.5, 0],
    [0, 1, 0],
    [0, 0, 0.583],
    [0, 0, 0.66],
    [0, 0, 1]
])

# 범례 1 그리기
ax.scatter(points1[:, 0], points1[:, 2], points1[:, 1], s=64.0, c="C1", edgecolors="k", alpha=0.5, label="221")

# 범례 2 그리기
ax.scatter(points2[:, 0], points2[:, 2], points2[:, 1], s=64.0, c="C2", edgecolors="k", alpha=0.5, label="227")

# 범례 3 그리기
ax.scatter(points3[:, 0], points3[:, 2], points3[:, 1], s=64.0, c="C3", edgecolors="k", alpha=0.5, label="225")

# 범례 4 그리기
ax.scatter(points4[:, 0], points4[:, 2], points4[:, 1], s=64.0, c="C4", edgecolors="k", alpha=0.5, label="206")

# 범례 5 그리기
ax.scatter(points5[:, 0], points5[:, 2], points5[:, 1], s=64.0, c="C5", edgecolors="k", alpha=0.5, label="141")

# 범례 6 그리기
ax.scatter(points6[:, 0], points6[:, 2], points6[:, 1], s=64.0, c="C6", edgecolors="k", alpha=0.5, label="etc")


ax.set_tlabel("$Fe$")
ax.set_llabel("$Mn$")
ax.set_rlabel("$Mg$")

ax.taxis.set_major_locator(MultipleLocator(0.25))
ax.laxis.set_major_locator(MultipleLocator(0.25))
ax.raxis.set_major_locator(MultipleLocator(0.25))


ax.grid(axis='t', which='both', linestyle='-')
ax.grid(axis='l', which='both', linestyle='--')
ax.grid(axis='r', which='both', linestyle=':')

# 범례 추가
ax.legend(loc="upper left")

plt.show()


